


"""

2520 - самое маленькое число, которое делится без остатка на все числа от 1 до 10.

Какое самое маленькое число делится нацело на все числа от 1 до 20?

"""


i = 0
b = 1
while i != 1:
    if (b % 1 == 0 and b % 2 == 0 and b % 3 == 0 and b % 4 == 0 and 
	    b % 5 == 0 and b % 6 == 0 and b % 7 == 0 and b % 8 == 0 and 
	    b % 9 == 0 and b % 10 == 0 and b % 11 == 0 and b % 12 == 0 and b % 13 == 0 and b % 14 == 0 and 
	    b % 15 == 0 and b % 16 == 0 and b % 17 == 0 and b % 18 == 0 and b % 19 == 0 and b % 20 == 0):
        print(b ," : is correct")
        i = 1
    b += 1




















